In [1]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [ ]:
#dropping unwanted variables
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

In [6]:
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [8]:
#taking out input and target
inputs =df.drop('Survived',axis='columns')
target = df.Survived

In [9]:
#converting test to numbers
#one hot encoding
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [12]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [13]:
inputs.drop(['Sex'],axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [14]:
#to find out any NaN in any columns
inputs.columns[inputs.isna().any()]
#so it says age column has it

Index(['Age'], dtype='object')

In [15]:
#filling Nan Values of age with mean
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [17]:
#train test split
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(inputs,target,test_size=0.2)

In [18]:
len(X_train),len(X_test),len(inputs)

(712, 179, 891)

In [19]:
#creating Naive Base model
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()
model.fit(X_train,y_train)

GaussianNB()

In [20]:
model.score(X_test,y_test)

0.7094972067039106

In [22]:
X_test[:10]

     Pclass        Age     Fare  female  male
796       1  49.000000  25.9292       1     0
15        2  55.000000  16.0000       1     0
588       3  22.000000   8.0500       0     1
803       3   0.420000   8.5167       0     1
556       1  48.000000  39.6000       1     0
206       3  32.000000  15.8500       0     1
50        3   7.000000  39.6875       0     1
707       1  42.000000  26.2875       0     1
875       3  15.000000   7.2250       1     0
367       3  29.699118   7.2292       1     0

In [23]:
y_test[:10]

796    1
15     1
588    0
803    1
556    1
206    0
50     0
707    1
875    1
367    1
Name: Survived, dtype: int64

In [24]:
model.predict(X_test[:10])

array([1, 1, 0, 0, 1, 0, 0, 0, 1, 1], dtype=int64)

In [ ]:
#if you canpare y_test and model predicts you can see the mistakes as accuracy is 70%